In [92]:
import numpy as np
import pandas as pd

In [93]:
lista1 = ['a', 'b', 'c'] # lista de strings
lista2 = [1, 2, 3] # lista de inteiros
arr = np.array([10, 20, 30]) # array numpy
d = {'a': 100, 'b': 200, 'c': 300} # dicionário

In [94]:
pd.Series(data = lista2, index = lista1) # cria uma série a partir de listas

a    1
b    2
c    3
dtype: int64

In [95]:
pd.Series(lista2,lista1) # cria uma série a partir de listas

a    1
b    2
c    3
dtype: int64

In [96]:
pd.Series(arr) # cria uma série a partir de um array numpy

0    10
1    20
2    30
dtype: int32

In [97]:
pd.Series(arr, lista1) # cria uma série a partir de um array numpy e uma lista

a    10
b    20
c    30
dtype: int32

In [98]:
pd.Series(d) # cria uma série a partir de um dicionário

a    100
b    200
c    300
dtype: int64

INDICES

In [99]:
serie1 = pd.Series([1,2,3,4], index = ['EUA', 'Alemanha', 'URSS', 'Japão'])

In [100]:
serie1

EUA         1
Alemanha    2
URSS        3
Japão       4
dtype: int64

In [101]:
serie2 = pd.Series([5,6,7,8], index = ['Azul', 'Verde', 'Amarelo', 'Vermelho'])

In [102]:
serie2

Azul        5
Verde       6
Amarelo     7
Vermelho    8
dtype: int64

In [103]:
serie1['EUA']

1

In [104]:
serie2['Azul']

5

In [105]:
serie1 + serie2

Alemanha   NaN
Amarelo    NaN
Azul       NaN
EUA        NaN
Japão      NaN
URSS       NaN
Verde      NaN
Vermelho   NaN
dtype: float64

> Note que as somas sairam todos com NaN, pq nenhum indice é repetido, portanto ele não soma a série.

In [106]:
serie3 = pd.Series([5,6,7,8], index = ['EUA', 'Alemanha', 'Itália', 'Japão'])

In [107]:
serie3

EUA         5
Alemanha    6
Itália      7
Japão       8
dtype: int64

In [108]:
serie1 + serie3

Alemanha     8.0
EUA          6.0
Itália       NaN
Japão       12.0
URSS         NaN
dtype: float64

> Aqui já é o contrário, pois o indice Alemanha, EUA e Japão se repetem tanto na serie1 quanto na serie3. Portanto, a soma acontece com as séries onde os indices se repetem.

DATAFRAMES

In [109]:
np.random.seed(101) # para garantir que os números aleatórios sejam sempre os mesmos

In [110]:
#df = pd.DataFrame(dados, nome_linhas, nome_colunas) # cria um DataFrame a partir de um dicionário

In [111]:
df = pd.DataFrame(np.random.randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

# 'A B C D E'.split() é o mesmo que ['A', 'B', 'C', 'D', 'E']

In [112]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

SELECAO E INDEXACAO

In [113]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [114]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [115]:
df.X # ou df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [116]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [117]:
df['Novo'] = df['W'] - df['X']

In [118]:
df

          W         X         Y         Z      Novo
A  2.706850  0.628133  0.907969  0.503826  2.078717
B  0.651118 -0.319318 -0.848077  0.605965  0.970436
C -2.018168  0.740122  0.528813 -0.589001 -2.758290
D  0.188695 -0.758872 -0.933237  0.955057  0.947567
E  0.190794  1.978757  2.605967  0.683509 -1.787963

In [122]:
df.drop(['Novo'], axis = 1, inplace=True) # remove a coluna 'Novo', axis = 1 indica que é uma coluna, se fosse linha seria axis = 0

In [124]:
df # a coluna 'Novo' não foi removida do DataFrame, permanece inalterado, portanto, inplace = True  é  necessário para que a alteração seja permanente.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [125]:
# Poderiamos também usar df = df.drop(['Novo'], axis = 1) para que a alteração seja permanente.

In [126]:
df.drop('E', axis = 0) # remove a linha 'E'

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [127]:
df.loc['A'] # retorna a linha 'A'

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [128]:
df.loc[['A', 'B']] # retorna as linhas 'A' e 'B'

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [130]:
df.iloc[0] # retorna a linha 0, que é a linha 'A'

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [131]:
df.loc['B', 'Y'] # retorna o valor da linha 'B' e coluna 'Y'

-0.8480769834036315

In [132]:
df.loc[['A', 'B'], ['W', 'Y']] # retorna as linhas 'A' e 'B' e as colunas 'W' e 'Y'

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

SELECAO CONDICIONAL

In [134]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [135]:
df > 0 # retorna um DataFrame com valores booleanos

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [136]:
df[df > 0] # retorna um DataFrame com valores positivos e NaN para valores negativos ou zero

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [138]:
df[df['W'] > 0] # retorna um DataFrame com valores positivos na coluna 'W'

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [141]:
df[(df['W'] > 0 ) & (df['X'] > 1)] # retorna um DataFrame com valores positivos nas colunas 'W' e 'Y', sendo o valor de 'Y' maior que 1 e 'W' maior que 0. Isso é feito com o operador &, que é o operador lógico 'E'

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509